
templates = [{
        'sheet_name': '01线路营收及人次报表',
        'table_name': '营收及人次报表',
        'start_row': 4,
        'vars': {
            'duration': (1, 0)
        },
        'row_number': True,
        'merges': [
            (0, 0, 0, 10),
            (1, 1, 0, 10),
            (2, 3, 0, 0),
            (2, 3, 1, 1),
            (2, 3, 2, 2),
            (2, 2, 3, 4),
            (2, 2, 5, 6),
            (2, 2, 7, 8),
            (2, 2, 9, 10)
        ],
        "titles": [
            (0, 0, '营收及人次报表'),
            (2, 0, '序号'),
            (2, 1, '线路'),
            (2, 2, '线路车辆数'),
            (2, 3, '营收现金'),
            (2, 5, '实体卡（IC卡）'),
            (2, 7, '银联+天交通二维码'),
            (2, 9, '线路小计'),
            (3, 3, '人次'),
            (3, 4, '营收'),
            (3, 5, '人次'),
            (3, 6, '营收'),
            (3, 7, '人次'),
            (3, 8, '营收'),
            (3, 9, '支付人次'),
            (3, 10, '营收')]
    },
    {
        'sheet_name': '01线路营收及人次报表',
        'table_name': '营收及人次汇总报表',
        'start_row': 3,
        'vars': {
            'duration': (1, 0)
        },
        'row_number': True,
        'merges': [
            (0, 0, 0, 4),
            (1, 1, 0, 4),
            (2, 2, 1, 2),
            (3, 3, 1, 2),
            (4, 5, 1, 1),
            (6, 6, 1, 2),
        ],
        "titles": [
            (0, 0, '营收及人次汇总报表'),
            (2, 0, '序号'),
            (2, 1, '类型'),
            (2, 3, '金额(元)'),
            (2, 4, '人次'),
            (3, 1, '现金总收入'),
            (4, 1, '非现金收入'),
            (4, 2, '银联+天交二维码通'),
            (5, 2, '实体卡（IC卡）'),
            (6, 1, '总计'),
        ]
    },
    {
        'sheet_name': '01票务中心',
        'table_name': '票务中心线路绩效报表',
        'start_row': 4,
        'vars': {
            'duration': (1, 0)
        },
        'row_number': False,
        'merges': [
            (0, 0, 0, 29),
            (1, 1, 0, 29),
            (2, 2, 1, 2),
            (2, 2, 3, 4),
            (2, 2, 5, 6),
            (2, 2, 7, 8),
            (2, 2, 9, 10),
            (2, 2, 11, 12),
            (2, 2, 13, 14),
            (2, 2, 15, 16),
            (2, 2, 17, 18),
            (2, 2, 19, 20),
            (2, 2, 21, 22),
            (2, 2, 23, 24),
            (2, 2, 25, 26),
            (2, 2, 27, 28),
        ],
        "titles": [
            (0, 0, '票务中心线路绩效报表'),
            (2, 0, '序号'),
            (2, 1, '线路'),
            (2, 2, '线路车辆数'),
            (2, 3, '营收现金'),
            (2, 5, '实体卡（IC卡）'),
            (2, 7, '银联+天交通二维码'),
            (2, 9, '线路小计'),
            (3, 3, '人次'),
            (3, 4, '营收'),
            (3, 5, '人次'),
            (3, 6, '营收'),
            (3, 7, '人次'),
            (3, 8, '营收'),
            (3, 9, '支付人次'),
            (3, 10, '营收')]
    },

]


